Repository: darktable-org/darktable
Catalog: doc/usermanual/po/cs.tmx
Source language: en
Languages: cs

source: offset of the frame line beginning on picture side
cs: posun linky rámečku s počátkem na okraji snímku

source: select border color
cs: vybrat barvu okraje

source: border color
cs: barva okraje

source: select frame line color
cs: vybrat barvu linky rámečku

source: frame line color
cs: barva linky rámečku

source: chromatic aberrations
cs: chromatické vady

source: automatic chromatic aberration correction
cs: automatická korekce chromatické vady

source: automatic chromatic aberration correction disabled for non-Bayer sensors
cs: automatická korekce chromatické vady funguje pouze pro snímky raw typu Bayer

source: automatic chromatic aberration correction only works for raw images.
cs: automatická korekce chromatické vady funguje pouze pro snímky raw.

source: channel mixer
cs: mixér kanálů

source: destination
cs: cíl

source: gray
cs: šedá

source: amount of red channel in the output channel
cs: míra červeného kanálu ve výstupním kanálu

source: amount of green channel in the output channel
cs: míra zeleného kanálu ve výstupním kanálu

source: amount of blue channel in the output channel
cs: míra modrého kanálu ve výstupním kanálu

source: swap R and B
cs: zaměnit R a B

source: swap G and B
cs: zaměnit G a B

source: color contrast boost
cs: zesílení barevného kontrastu

source: color details boost
cs: zesílení barevných detailů

source: color artifacts boost
cs: zesílení barevných artefaktů

source: B/W luminance-based
cs: čb založené na jasu

source: B/W artifacts boost
cs: zesílení čb artefaktů

source: B/W smooth skin
cs: čb vyhlazení pokožky

source: B/W blue artifacts reduce
cs: čb redukce modrých artefaktů

source: B/W Ilford Delta 100-400
cs: čb Ilford Delta 100-400

source: B/W Ilford Delta 3200
cs: čb Ilford Delta 3200

source: B/W Ilford FP4
cs: čb Ilford FP4

source: B/W Ilford HP5
cs: čb Ilford HP5

source: B/W Ilford SFX
cs: čb Ilford SFX

source: B/W Kodak T-Max 100
cs: čb Kodak T-Max 100

source: B/W Kodak T-max 400
cs: čb Kodak T-max 400

source: B/W Kodak Tri-X 400
cs: čb Kodak Tri-X 400

source: Choleski decomposition failed to allocate memory, check your RAM settings
cs: selhala alokace paměti pro Choleského dekompozici, zkontrolujte nastavení RAM

source: amount
cs: hodnota

source: size of features to preserve
cs: velikost struktury, která má být zachována

source: strength of the effect
cs: síla účinku

source: crop and rotate
cs: oříznout a otočit

source: invalid ratio format. it should be "number:number"
cs: chybný formát poměru stran. mělo by být "číslo:číslo"

source: full
cs: plné

source: old system
cs: starý systém

source: correction applied
cs: oprava aplikována

source: flip
cs: převrátit

source: both
cs: oba

source: mirror image horizontally and/or vertically
cs: převrátit snímek vodorovně a/nebo svisle

source: angle
cs: úhel

source: right-click and drag a line on the image to drag a straight line
cs: abyste namalovali přímku, klikněte pravým tlačítkem a táhněte na snímku

source: keystone
cs: vrchol

source: set perspective correction for your image
cs: nastavit korekci perspektivy snímku

source: freehand
cs: volný

source: original image
cs: původní snímek

source: 10:8 in print
cs: 10:8 v tisku

source: widescreen
cs: široká obrazovka

source: anamorphic
cs: anamorfní

source: invalid ratio format for `%s'. it should be "number:number"
cs: chybný formát poměru stran pro "%s". mělo by být "číslo:číslo"

source: set the aspect ratio the list is sorted: from most square to least square
cs: nastavit poměr stran řazení seznamu: od čtvercového k obdélníkovému

source: display guide lines to help compose your photograph
cs: zobrazit vodítka usnadňující kompozici fotografie

source: flip guides
cs: překlopit vodítka

source: horizontally
cs: vodorovně

source: vertically
cs: svisle

source: commit
cs: zapsání

source: [%s on borders] crop
cs: [%s on borders] oříznout

source: [%s on borders] crop keeping ratio
cs: [%s on borders] oříznout při zachování poměru

source: [%s] define/rotate horizon
cs: [%s] definovat/otočit horizont

source: contrast brightness saturation
cs: kontrast jas sytost

source: color saturation adjustment
cs: úprava sytosti barev

source: color balance
cs: vyvážení barev

source: lift/gamma/gain controls as seen in video editors
cs: ovládání lift/gamma/gain jako se používá ve video editorech

source: split-toning teal-orange (2nd instance)
cs: rozdělené tónování modrozelená-oranžová (2. instance)

source: split-toning teal-orange (1st instance)
cs: rozdělené tónování modrozelená-oranžová (1. instance)

source: generic film
cs: obecný film

source: similar to Kodak Portra
cs: podobný s Kodak Porta

source: similar to Kodak Ektar
cs: podobný s Kodak Ektar

source: similar to Kodachrome
cs: podobný s Kodachrome

source: controls
cs: ovládání

source: optimize luma from patches
cs: optimalizovat jas dle vzorků

source: optimize luma
cs: optimalizovat jas

source: neutralize colors from patches
cs: nastavit neutrální barvy pro vzorky

source: neutralize colors
cs: neutralizovat barvy

source: lift, gamma, gain (ProPhotoRGB)
cs: zdvih, gamma, zisk (ProPhotoRGB)

source: slope, offset, power (ProPhotoRGB)
cs: sklon, posun, mocnina (ProPhotoRGB)

source: lift, gamma, gain (sRGB)
cs: zdvih, gamma, zisk (sRGB)

source: color-grading mapping method
cs: metoda mapování stupňování barev

source: color control sliders
cs: posuvníky nastavení barev

source: input saturation
cs: vstupní sytost

source: saturation correction before the color balance
cs: úprava sytosti před vyvážením barev

source: output saturation
cs: výstupní sytost

source: saturation correction after the color balance
cs: úprava sytosti po vyvážení barev

source: contrast fulcrum
cs: střed kontrastu

source: adjust to match a neutral tone
cs: upravit pro nastavení neutrálního tónu

source: factor of
cs: faktor

source: factor
cs: faktor

source: shadows : lift / offset
cs: stíny : zdvih / posun

source: factor of lift
cs: faktor zdvihu

source: lift
cs: zdvih

source: select the hue
cs: vyberte odstín

source: select the saturation
cs: vybrat sytost

source: factor of red for lift
cs: faktor červené pro zdvih

source: factor of green for lift
cs: faktor zelené pro zdvih

source: factor of blue for lift
cs: faktor modré pro zdvih

source: mid-tones : gamma / power
cs: střední tóny: gama / mocnina

source: factor of gamma
cs: faktor gama

source: gamma
cs: gama

source: factor of red for gamma
cs: faktor červené pro gama

source: factor of green for gamma
cs: faktor zelené pro gama

source: factor of blue for gamma
cs: faktor modré pro gama

source: highlights : gain / slope
cs: světla: zisk / sklon

source: factor of gain
cs: faktor zisku

source: gain
cs: zisk

source: factor of red for gain
cs: faktor červené pro zisk

source: factor of green for gain
cs: faktor zelené pro zisk

source: factor of blue for gain
cs: faktor modré pro zisk

source: auto optimizers
cs: automatické optimalizace

source: fit the whole histogram and center the average luma
cs: vyplnit celý histogram a vystředit průměrný jas

source: optimize the RGB curves to remove color casts
cs: optimalizovat křivky RGB pro odstranění barevného nádechu

source: color look up table
cs: vyhledávací tabulka barev

source: it8 skin tones
cs: odstíny pokožky dle it8

source: helmholtz/kohlrausch monochrome
cs: helmholtz/kohlrausch monochromatický

source: Fuji Astia emulation
cs: emulace Fuji Astia

source: Fuji Classic Chrome emulation
cs: emulace Fuji Classic Chrome

source: Fuji Monochrome emulation
cs: emulace Fuji Monochrome

source: Fuji Provia emulation
cs: emulace Fuji Provia

source: Fuji Velvia emulation
cs: emulace Fuji Velvia

source: patch #%d
cs: vzorek #%d

source: (%2.2f %2.2f %2.2f) altered patches are marked with an outline click to select double click to reset right click to delete patch shift-click while color picking to replace patch
cs: (%2.2f %2.2f %2.2f) změněné vzorky jsou zvýrazněny obrysem kliknutí pro výběr dvojité kliknutí pro obnovení kliknutí pravým tl. pro smazání vzorku shift + kliknutí během výběru barvy pro náhradu vzorku

source: patch
cs: vzorek

source: color checker patch
cs: color checker vzorek

source: lightness offset
cs: posun jasu

source: chroma offset green/red
cs: posun chroma zelená/červená

source: green/red
cs: zelená/červená

source: chroma offset blue/yellow
cs: posun chroma modrá/žlutá

source: blue/yellow
cs: modrá/žlutá

source: saturation offset
cs: posun sytosti

source: target color
cs: cílová barva

source: control target color of the patches via relative offsets or via absolute Lab values
cs: řídit cílovou barvu vzorků skrze relativní posuny nebo absolutní hodnoty Lab

source: relative
cs: relativní

source: absolute
cs: absolutní

source: color contrast
cs: barevný kontrast

source: green vs magenta
cs: zelená vs purpurová

source: blue vs yellow
cs: modrá vs žlutá

source: steepness of the a* curve in Lab
cs: strmost křivky a* v Lab

source: steepness of the b* curve in Lab
cs: strmost křivky b* v Lab

source: color correction
cs: korekce barev

source: warm tone
cs: teplý tón

source: warming filter
cs: oteplující filtr

source: cooling filter
cs: ochlazující filtr

source: drag the line for split toning. bright means highlights, dark means shadows. use mouse wheel to change saturation.
cs: táhnutím namalujte vodítko pro dělené tónování. světlá pro světla, tmavá pro stíny. použijte rolování pro změnu sytosti.

source: set the global saturation
cs: nastavit globální sytost

source: input color profile
cs: vstupní barevný profil

source: can't extract matrix from colorspace `%s', it will be replaced by Rec2020 RGB!
cs: nelze extrahovat matici z barvového prostoru "%s", bude nahrazeno Rec2020 RGB!

source: `%s' color matrix not found!
cs: `%s' matice barev nenalezena!

source: input profile could not be generated!
cs: nelze vytvořit vstupní profil!

source: unsupported input profile has been replaced by linear Rec709 RGB!
cs: nepodporovaný typ vstupního profilu byl nahrazen lineárním Rec709 RGB!

source: input profile
cs: vstupní profil

source: working profile
cs: pracovní profil

source: ICC profiles in %s or %s
cs: profily ICC v %s nebo %s

source: gamut clipping
cs: oříznutí gamutu

source: confine Lab values to gamut of RGB color space
cs: vtěsnat hodnoty Lab do gamutu barvového prostoru RGB

source: colorize
cs: obarvení

source: source mix
cs: mix zdroje

source: select the hue tone
cs: vyberte odstín barevného tónu

source: select the saturation shadow tone
cs: vybrat sytost stínů

source: lightness of color
cs: jas barev

source: mix value of source lightness
cs: mix hodnota jasu zdroje

source: color mapping
cs: mapování barev

source: acquire as source
cs: nastavit jako zdroj

source: acquire as target
cs: nastavit jako cíl

source: source clusters:
cs: zdrojové clustery:

source: target clusters:
cs: cílové clustery:

source: analyze this image as a source image
cs: analyzovat tento snímek jako vstupní

source: analyze this image as a target image
cs: analyzovat tento snímek jako cílový

source: number of clusters
cs: počet clusterů

source: number of clusters to find in image. value change resets all clusters
cs: počet clusterů, které mají být nalezeny na snímku. změna hodnoty vymaže všechny clustery

source: color dominance
cs: dominance barev

source: how clusters are mapped. low values: based on color proximity, high values: based on color dominance
cs: jak jsou mapovány clustery. nízké hodnoty: založené na blízkosti barev, vysoké hodnoty: založené na dominanci barev

source: histogram equalization
cs: vyrovnání histogramu

source: level of histogram equalization
cs: úroveň vyrovnání histogramu

source: output color profile
cs: výstupní barevný profil

source: missing output profile has been replaced by sRGB!
cs: chybějící výstupní profil byl nahrazen srgb!

source: missing softproof profile has been replaced by sRGB!
cs: chybějící profil náhledu byl nahrazen sRGB!

source: unsupported output profile has been replaced by sRGB!
cs: nepodporovaný typ výstupního profilu byl nahrazen srgb!

source: output intent
cs: výstupní záměr

source: perceptual
cs: perceptuální

source: relative colorimetric
cs: rel. kolorimetrický

source: absolute colorimetric
cs: abs. kolorimetrický

source: rendering intent
cs: záměr transformace

source: color reconstruction
cs: rekonstrukce barev

source: spatial extent
cs: prostorový rozsah

source: range extent
cs: míra rozsahu

source: inconsistent output
cs: nekonzistentní výstup

source: module `color reconstruction' failed
cs: modul "rekonstrukce barev" selhal

source: precedence
cs: priorita

source: saturated colors
cs: saturované barvy

source: pixels with lightness values above this threshold are corrected
cs: pixely s hodnotou jasu nad tento práh jsou opraveny

source: how far to look for replacement colors in spatial dimensions
cs: jak se dívat daleko pro náhradní barvy v prostorových dimenzích

source: how far to look for replacement colors in the luminance dimension
cs: jak se dívat daleko pro náhradní barvy v jasové dimenzi

source: if and how to give precedence to specific replacement colors
cs: zda a jak upřednostnit specifické náhradní barvy

source: the hue tone which should be given precedence over other hue tones
cs: tón odstínu, který má mít prioritu před ostatními odstíny

source: color transfer
cs: převod barev

source: acquire
cs: pořídit

source: apply
cs: použít

source: this module will be removed in the future and is only here so you can switch it off and move to the new color mapping module.
cs: tento modul bude v budoucnosti odstraněn. a je tu jen proto, abyste jej mohli vypnout přejít na nový modul mapování barev.

source: number of clusters to find in image
cs: počet skupin, které mají být nalezeny na snímku

source: analyze this image
cs: analyzovat tento snímek

source: apply previously analyzed image look to this image
cs: použít výsledek předchozí analýzy vzhledu snímku na tento snímek

source: color zones
cs: zóny barev

source: red black white
cs: červená černá bílá

source: black white and skin tones
cs: černá bílá a odstíny pokožky

source: polarizing filter
cs: polarizační filtr

source: natural skin tones
cs: přirozené odstíny pokožky

source: black & white film
cs: černobílý film

source: cannot display masks when the blending mask is displayed
cs: když je zobrazena prolínací maska, nelze zobrazit masky

source: create a curve based on an area from the image click to create a flat curve ctrl+click to create a positive curve shift+click to create a negative curve
cs: vytvořit křivku dle oblasti na snímku. kliknutí pro vytvoření ploché křivky ctrl+kliknutí pro vytvoření pozitivní křivky shift+kliknutí pro vytvoření negativní křivky

source: edit by area
cs: upravit dle oblasti

source: edit the curve nodes by area
cs: editovat uzly křivky dle oblasti

source: display selection
cs: zobrazit výběr

source: select by
cs: vybrat dle

source: choose selection criterion, will be the abscissa in the graph
cs: zvolte kritérium výběru, bude hodnotou na ose x v grafu

source: process mode
cs: režim zpracování

source: strong
cs: silné

source: choose between a smoother or stronger effect
cs: vyberte mezi hladším či silnějším efektem

source: interpolation method
cs: metoda interpolace

source: change this method if you see oscillations or cusps in the curve - cubic spline is better to produce smooth curves but oscillates when nodes are too close - centripetal is better to avoids cusps and oscillations with close nodes but is less smooth - monotonic is better for accuracy of pure analytical functions (log, gamma, exp)
cs: změňte tuto metodu, pokud vidíte oscilace či hroty na křivce - cubic spline vede k vyhlazeným křivkám, ale způsobí oscilaci, jsou-li uzly příliš blízko - centripetal zamezuje hrotům a oscilacím u blízkých uzlů, ale způsobuje menší vyhlazení - monotonic vede k lepší přesnosti čistě analytických funkcí (log, gama, exp)

source: operation mode
cs: režim operace

source: global average (fast)
cs: globální průměr (rychlé)

source: local average (slow)
cs: lokální průměr (pomalé)

source: static threshold (fast)
cs: statický práh (rychlé)

source: method for color protection: - global average: fast, might show slightly wrong previews in high magnification; might sometimes protect saturation too much or too low in comparison to local average - local average: slower, might protect saturation better than global average by using near pixels as color reference, so it can still allow for more desaturation where required - static: fast, only uses the threshold as a static limit
cs: metoda zachování barev: - globální průměr: rychlé, může vést k drobných chybám v náhledu při vel- kém zvětšení; někdy může zachovat sytost příliš mnoho nebo naopak málo vůči globálnímu průměru - lokální průměr: pomalejší, může zachovat sytost lépe než globální průměr pomocí blízkých pixelů jako referencí, tedy stále umožňuje větší desaturaci, je-li třeba - statické: rychlé, použije pouze práh jako statický limit

source: edge detection radius
cs: poloměr detekce hran

source: radius for detecting fringe
cs: poloměr pro detekci posunu barev (fringe)

source: threshold for defringe, higher values mean less defringing
cs: práh pro defringe, vyšší hodnoty znamenají méně defringing

source: edge threshold
cs: práh hran

source: `%s' color matrix not found for 4bayer image!
cs: matice barev "%s" pro snímek 4bayer nenalezena!

source: method
cs: metoda

source: PPG (fast)
cs: PPG (rychlé)

source: AMaZE (slow)
cs: AMaZE (pomalé)

source: passthrough (monochrome) (experimental)
cs: průchozí (monochromatický) (experimentální)

source: demosaicing raw data method
cs: metoda demosaicingu raw dat

source: Markesteijn 3-pass (slow)
cs: Markesteijn 3-pass (pomalé)

source: frequency domain chroma (slow)
cs: frekvenční pásmo barevnosti (pomalé)

source: threshold for edge-aware median. set to 0.0 to switch off. set to 1.0 to ignore edges.
cs: práh pro medián dle hran. hodnota 0.0 pro vypnutí. hodnota 1.0 pro ignorování hran.

source: color smoothing
cs: vyhlazení barev

source: one time
cs: jednou

source: two times
cs: dva krát

source: three times
cs: tři krát

source: four times
cs: čtyři krát

source: five times
cs: pět krát

source: how many color smoothing median steps after demosaicing
cs: kolik kroků mediánové funkce vyhlazování barev po demosacingu

source: match greens
cs: vyrovnat zelenou

source: disabled
cs: vypnuto

source: local average
cs: lokální průměr

source: full average
cs: plný průměr

source: full and local average
cs: plný a lokální průměr

source: green channels matching method
cs: metoda porovnání zeleného kanálu

source: demosaicing only needed for raw images.
cs: demosaicing pouze pro snímky raw.

source: denoise (profiled)
cs: odšumění (s profily)

source: chroma (use on 1st instance)
cs: chroma (použít na 1. instanci)

source: luma (use on 2nd instance)
cs: jas (použít na 2. instanci)

source: found match for ISO %d
cs: nalezen pro ISO %d

source: interpolated from ISO %d and %d
cs: interpolováno z ISO %d a %d

source: compute variance
cs: spočítat odchylku

source: use only with a perfectly uniform image if you want to estimate the noise variance.
cs: použijte pouze s perfektně uniformním snímkem, chcete-li odhadnout odchylku šumu.

source: variance red:
cs: odchylka červené:

source: variance computed on the red channel
cs: odchylka spočtená u červeného kanálu

source: variance green:
cs: odchylka zelené:

source: variance computed on the green channel
cs: odchylka spočtená u zeleného kanálu

source: variance blue:
cs: odchylka modré:

source: variance computed on the blue channel
cs: odchylka spočtená u modrého kanálu

source: whitebalance-adaptive transform
cs: vyvážení bílé - adaptivní transformace

source: adapt denoising according to the white balance coefficients. should be enabled on a first instance for better denoising. should be disabled if an earlier instance has been used with a color blending mode.
cs: přizpůsobit odšumění dle koeficientů vyvážení bílé. pro lepší odšumění by mělo být aktivováno u první instance. mělo by být deaktivováno, byl-li u dřívější instance použit režim prolínání barev.

source: fix various bugs in algorithm
cs: opravit různé chyby v algoritmu

source: fix bugs in anscombe transform resulting in undersmoothing of the green channel in wavelets mode, combined with a bad handling of white balance coefficients, and a bug in non local means normalization resulting in undersmoothing when patch size was increased. enabling this option will change the denoising you get. once enabled, you won't be able to return back to old algorithm.
cs: opravit chyby v transformaci anscombe způsobující nedostatečné vyhlazování zeleného kanálu ve vlnkovém režimu kombinovaném s chybným použitím koeficientů vyvážení bílé, a chybu v normalizaci nelokálních průměrů způsobující nedostatečné vyhlazování, je-li velikost vzorku zvýšena. aktivace této volby změní míru odšumění. jakmile bude aktivováno, již není cesty zpět k původnímu algoritmu.

source: upgrade profiled transform
cs: upgradovat profilovanou transformaci

source: upgrade the variance stabilizing algorithm. new algorithm extends the current one. it is more flexible but could give small differences in the images already processed.
cs: povýšit verzi algoritmu stabilizace odchylek. nový algoritmus doplní ten stávající. je flexibilnější, ale mohl by vést k malým rozdílům pro již zpracované snímky.

source: profile
cs: profil

source: patch size
cs: velikost vzorku

source: search radius
cs: okruh hledání

source: scattering (coarse-grain noise)
cs: rozptyl (hrubozrnný šum)

source: central pixel weight (details)
cs: váha středových pixelů (detaily)

source: adjust autoset parameters
cs: upravit automatické parametry

source: preserve shadows
cs: zachovat stíny

source: bias correction
cs: korekce závislosti

source: non-local means
cs: nelokální stř. hodnoty

source: non-local means auto
cs: nelokální stř. hodnoty autom.

source: wavelets
cs: vlnková funkce

source: wavelets auto
cs: vlnková f. auto

source: profile used for variance stabilization
cs: profil použitý pro stabilizaci rozptylu

source: method used in the denoising core. non-local means works best for `lightness' blending, wavelets work best for `color' blending
cs: metoda použitá pro odstraňování šumu. nelokální střední hodnoty fungují nejlépe pro prolínání dle "jasu", vlnková funkce pro prolínání dle "barvy"

source: radius of the patches to match. increase for more sharpness on strong edges, and better denoising of smooth areas. if details are oversmoothed, reduce this value or increase the details slider.
cs: poloměr vzorků ke srovnání. zvýšit pro vyšší ostrost na silných hranách a lepší odšumění vyhlazených oblastí. pokud jsou detaily příliš vyhlazené, snižte hodnotu nebo zvyšte posuvník detailů.

source: emergency use only: radius of the neighbourhood to search patches in. increase for better denoising performance, but watch the long runtimes! large radii can be very slow. you have been warned
cs: pouze pro nouzové použití: poloměr pro hledání vzorků. zvětšit pro lepší účinnost odstranění šumu, ale pozor na dlouhou dobu zpracování! velký poloměr je velmi pomalý, byli jste varováni

source: scattering of the neighbourhood to search patches in. increase for better coarse-grain noise reduction. does not affect execution time.
cs: rozptyl sousedních hodnot pro hledání vzorků. zvýšit pro výraznější potlačení hrubozrnného šumu. neovlivňuje čas zpracování.

source: increase the weight of the central pixel of the patch in the patch comparison. useful to recover details when patch size is quite big.
cs: zvýšit váhu středového pixelu vzorku při porovnávání vzorků. užitečné pro obnovení detailů, je-li velikost vzorku poměrně velká.

source: finetune denoising strength
cs: doladit sílu odšumění
